// Room: /open/prayer/room/tanshu/1.c

inherit ROOM;

void create()
{
	set("short", "天樞門口");
	set("long", @LONG

    這裡是聖火教的分部,你抬頭一看,一塊大匾額上刻著--天樞門--
左下角刻的是林宏昇題,看那所題之字摁奈有力,想不到一代武聖並非
浪的虛名,再往裡面走就是天樞門的內部,奉勸你不要在裡面生事哦!!
這邊的門主可是忌惡如仇!

LONG
	);
	set("light_up", 1);
	set("exits", ([ /* sizeof() == 2 */
  "north" : __DIR__"2.c",
  "south" : __DIR__"11.c",
]));
	set("no_clean_up", 0);
	set("logn", "    這裡是聖火教的分部,你抬頭一看,一塊大匾額上刻著--天樞門--
左下角刻的是林宏昇題,看那所題之字摁奈有力,想不到一代武聖並非
浪的虛名,再往裡面走就是天樞門的內部,奉勸你不要在裡面生事哦!!
這邊的門主可是忌惡如仇!

");

	setup();
	}
