// goufu.c

#include "/open/open.h"

inherit NPC;

string do_ask();

void create()
{
  set_name("倒霉的轎夫", ({ "bad-luck man", "man" }));
  set("race", "人類");
  set("gender", "男性");
  set("age", 25);
  set("long","你正盯著轎夫看，他正聚精會神的研究賭術哩。\n");
  set("attitude", "peaceful");
  set("str", 26);
  set("cor", 22);
  set("combat_exp", 273);
  set("chat_chance", 8);

  set("chat_msg",({
        "倒霉的轎夫說道: 么\二三啊 !\n",
        "倒霉的轎夫說道: 四五六啊 !\n",
        "倒霉的轎夫說道: 昨天才輸光了褲子, 怎麼今天運氣還這麼背 !\n",
        "轎夫說道: 茶水喝完了也不添一點, 唉, 這些人喔...\n",
        "倒霉的轎夫說道: 聽說有個惡賭神找到一本賭神秘術，怎麼不讓我找到哩。\n",
        "倒霉的轎夫說道: 買好離手 !\n",
  }) );

  set("inquiry", ([
        "出關"          : "東南西北有四個關口, 也不知是哪一個?!",
        "賭術"          : "你想教我嗎? 不過, 聽說有一本賭神秘術, 也不知是不是真的!",
        "么\"           : "么\就是一點的意思嘛!",
        "么\二三"       : "么\二三就是骰子出一點或者出兩點或者出三點的意思。",
        "輸光"          : "唉, 說起來慚愧\, 跟惡賭神賭, 一連輸了四十幾把, 不輸光才怪!",
        "惡賭神"        : "不就是軒轅三光嗎? 不跟他賭硬逼人跟他賭。",
        "軒轅三光"      : (: do_ask :),
        "賭神秘術"      : "聽說有了這本書之後, 可以縱橫賭場, 要它開幾點就開幾點！",
        "茶水"          : "你要幫忙倒茶水? 先謝謝你囉!",
        "運氣"          : "說什麼運氣, 還不是軒轅三光賴賬, 哼, 要是有本事, 一定砍死他!",
        "賴賬"          : "對付賴賬的人應該抄傢伙扁他一頓。",
        "抄傢伙"        : "別抄傢伙打我啊!",
        "扁他一頓"      : "對對對, 這位英雄就靠您為小的出口怨氣",
        "出口怨氣"      : "唉, 除了忍氣吞聲還能怎樣呢？",
        "忍氣吞聲"      : "就靠您幫我們出口怨氣了。",
  ]) );

  set_temp("apply/attack", 15);
  set_temp("apply/damage", 3);
  set_temp("apply/armor", 2);
  setup();
}

string do_ask()
{
  object        me=this_player();

  if (me->query("quests/gamble_book")) return "軒轅三光不就在賭場嗎?\n";
  me->set_temp("quests/gamble_book",1);
  return "據說他昨晚後來輸光光, 為了躲債, 出關去了。";
}
