// Room: /open/capital/room/head_room.c
inherit ROOM;

void create ()
{
  set ("short", "京城賞金兌換處");
	set( "build", 94 );
  set ("long", @LONG

由於天下大亂、群魔亂舞，朝庭以經無法維持天下太平的局勢!!!
為了天下蒼生，故貼出此『追殺賞金榜』盼有有志之士能為民除害!!!
賞金榜：
---------------------------------------------------------------
    焚天魔王人頭   7500兩黃金      獨孤嵊人頭    750兩黃金
    蛇郎君人頭     3000兩黃金    聖火教主林宏昇  750兩黃金
    黃金甲龍龍頭    650兩黃金          七魔將    500兩黃金
    黑白雙剎        600兩黃金    風林大頭目雷霸  200兩黃金  
    風林三頭目張繼   40兩黃金      二頭目劉信     60兩黃金
    黑風雙剎梅超風  120兩黃金       平南獨角獸    10兩黃金    
-------------------------------------------------------------
LONG);

  set("no_kill", 1);
  set("light_up", 1);
  set("no_magic", 1);
  set("exits", ([ /* sizeof() == 1 */
  "west" : __DIR__"r71",
]));
  set("objects", ([ /* sizeof() == 1 */
  "/open/capital/npc/sell-officer.c" : 1,
]));

  setup();
}
