// keeper.c

inherit NPC;

void create()
{
        set_name("村民", ({ "man" }) );
        set("long",
                "一位來此採買的客人，原本在跟商店老闆聊天，但在你進來之後臉色
就變得相當難看。\n");

        set("race", "人類");
        set("gender", "男性");
        set("age", 33);
        set("limbs", ({ "頭部", "身體", "左手", "右手", "左腳", "右腳" }) );

        set("str", 21);
        set("cor", 19);
        set("cps", 17);

		set("combat_exp", 65000);
        set("inquiry", ([
            "桃花源"   : "這裡真是一個鳥語花香的好地方，要不是有你們這種外地人...哼！\n",
			"規矩"     : "哼哼......就是那村長不遵守規矩讓那個外地人吃下遺忘桃，這桃花村才會出事。\n",
			"寶物"     : "保護？沒踢走你就不錯了，要什麼保護費。\n",
			"玲玲"     : "真是一個嬌滴滴的美人呀。\n",
			"傳說"     : "去它的傳說，那種子虛烏有的傳說害死我們村了。\n",
			"村長"     : "他是個老好人，不該受這種折磨的...\n",
			"水井"     : "口渴不會去外面喝水喔，滾！\n",
			"桃樹"     : "外面就有。\n",
			"桃子"     : "自己去採吧，要不我賣給你也不錯，一顆一金要嗎？\n",
			"遺忘桃"   : "據說會忘記一些事，例如...技能。\n",
		]) );

        setup();

}

void init()
{
	object me=this_player();
	if (me->query("combat_exp") > 1000000)
	{
		me->set_temp("quests/peach/mark", 1);
	}
	return;
}
