// man.c

inherit NPC;
string ask_yes();
string ask_happen();

void create()
{
        set_name("玲玲的戀人", ({ "stranger" }) );
        set("long",
                "在離開之後才明白自己是思念著玲玲的男人，在與好朋友商量之後，\n決定再回來桃花村追求愛情。孰料...\n");

        set("race", "人類");
        set("gender", "男性");
        set("age", 25);
        set("class","booker");
        set("nickname","新郎");
        set("limbs", ({ "頭部", "身體", "左手", "右手", "左腳", "右腳" }) );

        set("str", 16);
        set("cor", 22);
        set("int", 19);
        set("cps", 23);
        set("kar", 29);
        set("inquiry", ([
            "桃花源"       : "這裡風景好，空氣好，就連女人也......你不能跟我搶玲玲。\n",
			"規矩"         : "別再跟我說那件事了，我不想忘記玲玲。\n",
			"寶物"         : "(傳說)這裡埋藏了數以千計的金銀珠寶喔！\n",
			"傳說"         : "玲玲她父親應該知道不少吧。\n",
			"玲玲"         : "她的心地好，又有文學素養，臉蛋也不錯，身材玲瓏有緻，真是......\n跟你說我沒在流口水啦。\n",
			"村長"         : "這是我的疏失，沒想到那人竟然欺騙我，綁走了玲玲的父親。\n",
			"水井"         : "你渴了嗎？\n",
			"桃樹"         : "你餓了嗎？\n",
			"桃子"         : "你餓了嗎？\n",
			"遺忘桃"       : "你該不會想吃吧？\n",
]));

        set("combat_exp", 150000);

        setup();

}
