
仙劍派軼事
------------------------------------------------------------------------------
     深夜, 皎潔的月色柔鋪著大地, 無聲地細流過仙劍派的前山. 前山瀑布水聲潺潺,
涼霧緩緩地飄過門前的石階, 好個詩意滿懷, 仙氣繚繞的地方.

   瀑布之下, 涼庭之旁, 一個腰纏軟劍, 身穿淡金色衣裳的十八九歲左右的秀氣女子
俏立在月色當中, 臉上似乎微微的帶著愁容, 末了, 還發出的一聲若有若無的嘆息.
  「師妹,還沒睡呀?」另一名身穿白衣的二十歲左右少女走了過來.  
  「嗯, 師姐...」黃衣少女回頭微微地笑著
   身穿黃衣的是仙劍七俠中排名第六的何雙雙, 在江湖上以身法迅捷配合變幻莫測的
軟劍聞名, 搏得了「纖雲弄巧」的稱號.而白衣少女則是排名第五的「東城飛雪」梅影
女俠.
  「師妹, 妳是不是在想三師哥的事?」梅影微笑地在涼庭中的石椅坐了下來.
  「師姐, 那有啦...」心事被道破, 何雙雙剎時間害羞地暈紅了兩頰.
  「師妹妳就別再害羞了, 我從小就是妳的表姐, 又一起進入仙劍派學藝, 妳的心事又
何時瞞過我了? 其實妳會對三師哥傾心, 也是自然. 三師哥年紀比我們只大幾歲, 武功
又好, 為人又溫文儒雅, 也難怪我們從小便一直古靈精怪的何小師妹會芳心暗許於三師
哥呢」梅影笑嘻嘻地調侃著何雙雙.
  「師姐!妳再說...」何雙雙氣急敗壞地追打著梅影.
  「好好...我不來取笑妳啦...饒了我吧」梅影笑著閃過了何雙雙的搥打.
  「唉...師姐, 我如果能像妳那麼溫柔體貼就好了...」何雙雙突然嘆了一口氣, 在涼
庭旁坐了下來.
  「師妹? 」梅影有點不解.
  「師姐...我知道, 三師哥喜歡的其實是妳, 若你倆情投意合, 師妹也會祝福你們的」
  「雙妹, 別胡說, 我和三師哥之間沒有兒女私情. 況且雙妹妳個性開朗大方, 和三師
哥的溫文儒雅才是天造地設的一對. 」梅影斷然地說.
  「可是三師哥最近似乎心情不好, 我看他自個兒練劍時招式憂鬱似有無盡心愁, 我怕
他...」何雙雙擔憂地說.
  「嗯, 三師哥近日所創的劍路的確不同於我仙劍一向的講求飄逸, 有肅殺之氣包函其
中. 但師父看過之後亦是一笑, 我想並無大礙才對.」梅影若有所思.
  「對了, 這次師父又說要閉關一百天, 到底是為何緣故啊?」何雙雙問道.
  「聽三師哥說, 除了要再精研劍陣外, 最主要是要嘗試創出仙劍後三式」梅影回答說
. 天上的一道烏雲恰好漸漸掩住了月光.
  「仙劍後三式? 師父真的可以創出這已經失傳的三招最具威力的仙劍劍法?」
  「我不知道.」梅影搖搖頭說「聽說當年綠毛老祖大鬧仙劍派之後, 祖師爺便沒將剛練
成的後三式傳授給師祖, 至於原因我也不太曉得」月光又漸漸地顯露出來.
  「因為逍遙子太過膿包, 練後三式練出了岔, 才會導至綠毛老祖大鬧仙劍.」一個冷冷
的聲音在兩人背後響起.
  「誰!?」兩人迅速回頭, 只見一個神情冷漠的中年男子立於涼庭旁.
  「閣下是誰? 夜訪我仙劍派有何要事?」梅影口中說著, 心中卻忐忑不安:「連本派山
前的蜀山奇陣都可輕易通過, 此人定非泛泛之輩. 只怕來者不善, 但師父正在坐關, 三
師哥又駐守師父關前, 大師兄和二師兄又有事不在, 此刻只有我和小師妹在此, 情況可
不太妙...」
  「哈哈...」那人旁若無人地仰天大笑起來「仙劍派自從逍遙子失蹤後便只剩下這些
龜孫子們, 別說就憑妳們, 就算當年的逍遙子我也不放在眼裡!」
  「放肆!!竟敢出言污蔑祖師爺!」何雙雙嬌聲一叱, 信手一揚纏在腰間的軟劍瞬間出
鞘, 一招「寒芒沖霄」直取那中年男子.
  「雙妹小心!」梅影一邊擔憂地提醒著, 手中卻不停留, 梅影劍鏗然出鞘, 霎時間寒光
點點, 有如片片白雪飄飛. 
  「久聞仙劍劍招飄逸絕倫, 姿態美妙, 如今一見果然名不虛傳!」那人並未拔劍, 只以
一種近乎詭異的身法遊竄於兩人之間, 一面口中繼續說道「只可惜功力仍嫌不足!」說完
那人身形一變, 出手逕點向兩人大穴.
    那人似乎並不急, 只是與梅影和何雙雙兩人游鬥著. 久戰不下, 梅影心中開始焦燥
起來, 對方到目前為止雖還未用劍, 但憑兩人之力卻根本傷不了他分毫, 若被他闖過了
這一關, 仙劍派內部弟子恐怕無人能敵. 心急之下, 劍式陡變, 劍法狂性驟起, 口中喃
喃有辭, 使出仙劍禁斷之連陽七訣第五式「冬陽」, 手中梅影劍虹芒大盛, 氣運「劍影
連陽」之訣, 往那人直刺而去. 此招一出必定傷人, 故梅影輕易不用, 可說是梅影的成
名絕招.
  「嗯!?」那人眼中精光一閃, 腰間長劍立時出鞘, 飛身迴旋, 避開了梅影的「冬陽」
劍氣, 一面冷冷說道:「能逼我長劍出鞘, 姑娘這招果然頗有內函, 但讓我長劍一出, 
妳們只是死得更快罷了!」說完劍花一挽, 使出劍法與兩人鬥了起來.
    那人劍式招招陰柔, 式式詭異, 看似無力卻殺機無限, 宛如水般之柔, 又有寒氣之
屬. 兩人從未看過此等劍法, 一時間便陷於苦戰, 雖是以二對一, 兀自是遮多攻少.
  「梅影姑娘,」那人一面出招刺向何雙雙, 何雙雙使出全力, 以快制快連續刺出七七四
十九劍織成一道劍網將此式全部蕩開.「若論陰寒劍氣, 只怕仙劍派沒有一招能與我的劍
法相比!」那人說得沒錯, 一輪激戰下來他劍上所激發的寒氣已使得周遭草木葉子上都
結了一層薄霜, 更使得兩人劍勢越來越澀滯, 敗象越來越是明顯.
   何雙雙見勢不妙, 叫道「師姐, 鶴翔紫薇!」說著身形加快, 手中紫薇軟劍紫光大盛
劍身忽柔已將那人手中之劍纏住. 梅影一聲輕叱手中梅影劍同時已刺向那人背後, 正是
仙劍「陰陽兩儀劍陣」中的精妙絕招.
  「好劍法!!」那人一聲大喝, 手中長劍忽然一滑如游魚般脫出了紫薇軟劍的纏繞, 想
也不想, 往後便將劍招遞出.
  「師姐危險!」何雙雙驚道. 只見梅影劍被激上半空中, 隨風輕飄, 卻被人順手一摘,
似在一陣狂風中摘下了一朵飄泊無依的梅花. 只見另一白衣男子不知何時已站在涼庭之
上, 衣衫飄飛, 宛若神仙.
  「閣下是誰? 」神祕人冷冷的說.
  「在下李夢枕, 晚輩不才, 斗膽請前輩就此罷鬥如何? 」李夢枕一邊說著, 一邊從涼
庭上躍了下來.
  「小子, 我不管你是誰, 若定要插手管我閒事, 我連你一併殺了!」那人言語自負, 仰
首朝天.
  「這位前輩, 雖不知你的身份, 但從劍路上看來, 前輩定是西域天水劍派的絕代高手.
不知為何定要與仙劍派結仇? 」
  「哦...」那人臉色稍緩.「想不到我初次涉足中原, 竟會有人識得我的劍法. 只不過
...哼!」那人殺氣陡盛「仙劍派名滿天下, 我這次孤身前來, 便是要會一會仙劍的掌門
鄭士欣, 讓中原武林都知道, 仙劍派只不過是群浪得虛名之輩!」
  「好狂妄的口氣! 」何雙雙忍不住叱道「別說我師父正在坐關沒空和你磨菇, 若在平
時, 肯定你也不是我師的對手!」
  「哈哈哈...」那人仰天冷笑「勢才我手下留情, 早已瞧出了你們兩位姑娘的底子也只
不過爾爾, 如此看來鄭士欣那老頭也好不到哪兒去了, 哈哈...」
  「你!」何雙雙氣的咬牙切齒, 手一揚便欲拔劍再戰.
  「何女俠請勿衝動. 」李夢枕急忙出言阻止, 一邊說道「既然前輩意欲找鄭掌門切磋
劍術, 何不稍候幾日, 待鄭掌門出關後再做比試? 」
  「哼哼...比試是終要比的, 不過在比試之前, 我先殺了這兩個姑娘殺殺仙劍派的威風
    李夢枕急忙道「既然前輩定要動手, 就由晚輩奉陪幾招如何? 」
  「哦...」那人冷冷的說「小子, 這本不關你的事, 若你定要阻攔, 我出手不留情, 第
一個先殺了你!!」
  「公子一番好意我們心領了」梅影說道「還請公子速速離去, 不用替我們作無謂犧牲, 
小女子與師妹盡力一拼便了. 」
  「梅姑娘言重了」李夢枕搖搖頭說道「在下有幸, 習得幾手仙劍劍術, 還請梅姑娘將
寶劍借在下一使. 」
  「咦...」梅影與何雙雙面面相覷.
   那人冷笑道「原來仙劍諸多欺世盜名之輩, 會拿劍的人都稱自己為仙劍派! 看我今日
先殺了你這狂妄的臭小子!!」語畢劍勢便向李夢枕襲了過去.
  「這位前輩...」李夢枕一邊使招「鐵鎖橫江」格開了對方的攻勢, 一邊說道「陰寒劍
招並非你天水劍派所擅長, 在仙劍劍法中, 便有一招足可與貴派抗衡. 」語畢劍勢一變,
狂性驟起.
  「咦!?冬陽...」梅影的驚訝並不是沒有理由的, 因為李夢枕這一招的起手式正是她的
成名絕技, 仙劍禁斷之連陽七訣中的「冬陽」!!但細看又略有不同, 李夢枕使來的更具
精妙, 散發陰寒之氣也非梅影所能比的.「冬陽這一式是師父所親傳, 究竟他是從何學得
這一式的? 」
   李夢枕內勁頓轉, 瞬時間一股寒氣籠罩身旁, 只見劍上薄冰漸起幻成冰柱, 李夢枕愈
使愈快, 宛若洶湧巨浪瞬時壓力遽增霎時四周水波雲氣變化萬千, 那人瞬間分不清劍在
何方, 就在遲疑之際, 李夢枕手中的梅影劍捲起狂霜亂雪直搗向那人心口.
  「噹!」的一聲, 四周煙霧瀰漫, 那人向後退了兩步, 手中長劍微微顫抖著.
   梅影與何雙雙擔憂地看著李夢枕, 此戰不知誰勝誰負.
  「好劍法!!」過了半晌, 那人才緩緩說道.「請問閣下是仙劍派第幾代弟子!?諒鄭士欣
也未必有此功力.」
  「前輩過獎了」李夢枕亦緩緩的說「在下並非仙劍弟子, 但久聞鄭掌門的雙十旋龍斬
和七陽連天舉世無雙, 又豈是在下所能相比? 」
  「哼!!咱們後會有期!」那人說完便忿而施展輕功而去.
  「李公子你沒事吧? 」梅影和何雙雙走近了李夢枕身邊.
  「我沒事. 」李夢枕搖搖頭, 一面將手中梅影劍交還給梅影「但此人能接下我冬陽天
冰一式, 恐怕絕非天水劍派的一般高手. 具我推測, 他應是天水劍派的掌門.」
  「素來只聞情刀枕夢李公子的星夜醉夢刀法為武林一絕, 想不到連本派的劍法也使得
出神入化, 小女子深感佩服. 」梅影由衷的說. 她知道李夢枕是為了保留仙劍派的顏面
和為她出一口氣才會以「冬陽」一式打敗對方, 否則若以他的「星夜醉夢刀法」或可克
敵致勝, 但卻顯得仙劍劍法低了一截了. 再者「仙劍禁斷連陽七訣」中也只有「冬陽」
是唯一的陰寒之招, 而李夢枕選用此招頗有維護之意. 想到這裡, 梅影更是心存感激.
  「梅姑娘言重了, 其實在下與仙劍派甚有淵源, 只不過傳在下劍法的師尊要在下嚴守
祕密, 若不是今晚為貴派出手, 在下使用貴派劍法已違當日之誓. 這一點還請兩位多多
體諒.」李夢枕笑著說.
  「李公子請放心, 今晚之事, 我倆師姐妹必為公子保密, 絕不會洩漏出去. 」梅影斷
然地說.
  「包涵了...」李夢枕一邊說著, 眼神卻注視著前山瀑布下方, 心裡暗道:「師父, 請
忍耐, 我定會想辦法救你的...」
------------------------------------------------------------------------------

 

