inherit ROOM;
void create() {
	set( "short", "hild 打save eq rules" );
	set( "owner", "hild" );
	set( "item_desc", ([
		"hild_rules" : @ITEM
打save eq 規定 <- hild 幫解的限定條件

因為現在為了鼓勵新玩家，我就把打save eq
的經驗值降低，但是我希望再解到save eq的
玩家希望保住自己的真身，因為有些save eq
是檢不起來的。

ps:我定skill全滿是以自己mob 師傅skill全滿就好
   比方說你snow app 玩家，不是以玩家skill全滿
   而是以snow master<-劉全書skill都滿了就可以

現在save eq 有很多不過需要人幫打大致如下

焚天鬼王eq <-這系列eq比較特殊，因為有exp限制要300 萬以上才能全部穿起來

青蛇護符   <-這個護符因為要去蛇寨打金蛇郎君，然而他掉的機率要真的是賽王
             才能再五次以內打到，像hild成經打過3x隻才掉。因為機率不高所
             以我定這個eq我希望玩家exp再200萬以上，因為這個eq能撿起來，
             但是，金蛇郎君很機車，你只要busy金蛇郎君，他就會補血，所以
             我希望再解他的人除了exp 200 萬以上，還有skill都要滿。這是
             條件。
             功效：耶只是加強你的enable 攻擊 10 and enable force 10                              

妖幻之心  <-風舞陽，說真的他還是很恐怖，因為皮很硬，又會上一堆狀態，可以
            說不好打，不過我打還可以打贏，有點辛苦拉，不過為了鼓勵玩家，
            讓大家能解到，所以我定skill要滿，exp 再100萬以上。

            功效：有85%心跳恢復精氣神功能。<-平時戰鬥中都會發動。
                  沒有心跳顯示是因為，你想85%的心跳率如果顯示在話
                  面上多洗畫面阿。


魔龍睛戒 <-這個要打獨孤嵊(sa)，這個我只能說，我帶你們打，我只敢說我只有八
           成機率能帶你們解到，我為何這麼說，因為聖火畢竟不是打 % 的門派，
           對於解這個eq，定skill全滿，exp 100 萬以上，因為我帶的話，就算是
           500萬也有兩成的機率會解不到。因為sa就算暈了，你對他下k還是會有
           心跳會出來的。至於幫派是打%的門派(刀客)，holeman，解道機率更大
           幾乎可以到達9成5，不過幫派要解，幾乎還是都找我居多拉，所以解這
           個sa，身上一定要帶補血聖品。快死吃pill，比較不會死。


火龍之鱗 <-這個歐，要求就要嚴格了，為何這麼說，因為這是火龍幻界的特產，
           因為他有lv 1 ~~ lv 5，基本上打這個也要運氣，還有火龍幻界，要
           求exp需要500萬才能進去，當你500 one skill一定也都滿了，不過
           因為火龍王很耐打而且他不會暈，通常都是直接死，所以解要有運氣
           。這eq功能就是防火。再火龍幻界，有兩種防火，一個是火龍鱗的防
           火lv1-lv5就是防火能力，lv5是最高的，還有一種就是醫生的防火絕
           兩個都能抗火，不過要火龍鱗lv 5+醫生的防火，才能將火龍幻界的
           噴火攻擊降到最低。
    

皆傳之證 <-這個eq可以說是後期的必備品，因為要求高也麻煩，不過為了讓大家
           提早變強，我定這個exp五百萬就能解，不過身上的特功要全滿，有
           force lv 455，青蛇護符 妖幻之心 魔龍睛戒 這三個防具一定要有
           (ps當然exp 越高越好，我條件放寬，讓大家打mob都輕鬆所以降低標準)
           因為解那個一定要有這三個防具才能安全通過路程。再來就是這個迷
           一定要解9.  1 失落的聚靈山莊，至於解法不會的請教幫派高階，
           再來就是要再wa 1 7 n 再一重開就佔在那邊，那邊會生出tree(木無言)
           sick(皇帝病)，你得佔到11:00(因為11:00才會出現)，因為那隻很搶手
           所以，要解的請自己麻煩一下。
           功效：加快速招攻擊的速度，要殺氣1500以上才會發動。


ω冥魔寶盒ω其實還有這個eq這個是ghost king eq 可是這個要收集13件，如果要
            這個請自己以後自己收集，我不太會幫人去收集那個eq。除非我打一
            打剛好打到兩套我自然會發給大家和需要的人。


五轉聚靈盤 這個eq要打的是全fs最變態的mob，基本上要解這個得要出動幫派三個人
           以上，如果沒有找齊三個人我是不會出動的，要解的話，麻煩請自己找
           幫派三階跟二階 還有exp 1000 one 以上and 解過hands 幫派玩家。
           一定要三個人，還有要夠耐打。要不然是不好解的。所以要解找我基本上
           只要我時間許可我一定ok，第二要有borkiller，第三就找mudu or working
           or holeman 都是很棒的。


再以上我希望解到請保重自己真身，別死因為重要的save eq 都是無法從corpse撿起
如果，你解到了，自己不注意死真身我是不會管你的，要從解真的是麻煩中的麻煩
，還有一件事情，由於有些save eq 解要花時間，跟運氣，所以我希望我一天經手一
件。希望大家都能變強，變強之後能回饋幫派，這樣我就不枉費幫助各位幫眾。

還有你要解，希望你再幫派流言板上先預約，希望有空有能力的人能幫帶。
預約方法寫上 日期，時間，解哪個。
如果是需要出團的五轉盤，要寫上日期，時間，還有要出團的人。

還有這是我自己帶人解的條件，其他人的基準是不同的，所以不要把我的基準拿去，
要求其他高階層的帶，除非那高階層的人說ok，不然被我知道的話，我是會生氣的。

                                                天道無極～斐爾德HILD～敬上

ITEM,
	]) );
	set( "exits", ([
		"chome"     : "/open/clan/sky-wu-chi/room/hall",
	]) );
	set( "long", @LONG
打save eq 規定 <- hild 幫解的限定條件

因為現在為了鼓勵新玩家，我就把打save eq

的經驗值降低，但是我希望再解到save eq的

玩家希望保住自己的真身，因為有些save eq

是檢不起來的。

詳細情況請 look hild_rules
LONG);
	setup();
	replace_program(ROOM);
}
