inherit ROOM;
void create() {
	set( "short", "血痕居-三才劍" );
	set( "owner", "holeman" );
	set( "build", 10011 );
	set( "exits", ([
		"west"      : "/open/clan/sky-wu-chi/room/room514.c",
		"northwest" : "/open/clan/sky-wu-chi/room/room519",
		"north"     : "/open/clan/sky-wu-chi/room/room521",
	]) );
	set( "long", @LONG

蘇秦背劍奔陽光    仙人指迷路狄川    金針暗渡苦求藝    哪吒探海波浪翻

回頭望月紫燕摺    寒茫沖霄去妙藏    移山倒海宇宙震    指日高陞起烽煙

捨身取義龍探爪    撥雲瞻目曙光嚴    羽容揮塵劍鋒緊    白蛇吐信腹腸摜

古月沉江碧竹掃    懷抱玉屏遮胸間    津津架海渡浪城    孤樹盤根鈄鋒剪

美女紉針穿刺巧    三環套月遙玉環    猛虎戲山掩日戈    風捲殘雲宇宙施

橫掃千軍我揚武    鳥龍翻身離法潭    玉虎施鳳行千里    毒蝎反尾鈄鋒捲

黑虎坐洞牢寵計    青龍出水露連天    葉裡藏身偷挑式    獅子搖頭把尾翻

飛虹橫江雲舞南    繫起玉柱極地懸    玉女送書仙人指    天邊掛月將日換

掃徑尋梅揮塵客    金盤托月雲遊仙    蛟龍出水雲霧散    璧竹掃影日西山

神龍探爪金探架    白鶴舒翼孤樹盤    童子提爐霓萬道    蛺蝶穿花尋奇緣

順風扯旗迎日展    龍跳登門虎登山    海底撈月針飛影    丹鳳朝陽自鳥喧

順水推舟心勿虞    走馬觀山償奇岩    指南金針分子午    太公垂鈞文訪賢

天壬托塔乾坤定    宗璧歸趙宇宙安    卻黑古人聞雞起    三才劍法術通仙



LONG);
	setup();
	replace_program(ROOM);
}
