

                01   02   03     04   05   06
                 |    |    |      |    |    |
                07 - 08 - 09  -  10 - 11 - 12
                 |    |                |    |
40 - 41 -  38 - 13   14   15  -  16   17   18
                 |    |      37        |    | 
                19   20   21  -  22   23   24 - 39 - 42 - 43 - 44 - 45
                 |    |                |    |
	        25 - 26 - 27  -  28 - 29 - 30
                 |    |    |      |    |    |
	        31   32   33     34   35   36

01-武器店   02-防具店   03-道具店   04-一般民宅 05-于風的家 06-鎮長的家
07-西鎮道   08-北鎮道   09-北鎮道   10-北鎮道   11-北鎮道   12-東鎮道
13-西往橋   14-旅店     15-西北廣場 16-東北廣場 17-翠柳的家 18-東鎮道
19-西鎮道   20-雲風商店 21-西南廣場 22-東南廣場 23-雲風錢莊 24-東來橋
25-西鎮道   26-南鎮道   27-南鎮道   28-南鎮道   29-南鎮道   30-東鎮道
31-販肉攤   32-水果攤   33-蔬菜攤   34-醉雲居   35-當鋪     36-破屋
37-廣場中央 38-雲風西道 39-雲風東道 40-小平原   41-平原小徑 42-小草原
43-小森林   44-密林     45-密林迷陣 46-密林迷陣 47-密林迷陣 48-密林迷陣
