#include <ansi.h>

inherit NPC;
string check_future()
{
	object me = this_player();
	if( me->query("quests/kill-dugur") && !me->query("quests/back-young") )
		return "「獨孤一掌天下動﹐千書一指武林驚。」";
	return "天機不可洩漏也 ...。\n";
}
string a_array()
{
if(this_player()->query("quests/sblood")==0)
command("say 啥...你說啥?? ");
else
{
command("say 天門奇陣為一威力極強之陣法，此陣由大破魔師所設，武林傳言，先劍祖師曾藉開天三靈器合刀神儒俠之力設下此陣.");
command("say 至於如何開啟....我就不知道了...");
}
}
string ask_ball()
{
 if(!this_player()->query_temp("swordtime"))
 {
  return ("對不起﹐你問的事我實在沒有印象。");
  }
 else
  {
  if (this_player()->query("class")=="blademan")
    {
    this_player()->set_temp("swordquest/findball",1);
    return ("夜千鳥晶珠，是傳說中靈刀夜千鳥的靈力之源，然則，因逍遙子拿他作為開天三才陣的封印因此從靈刀中被抽出，現在已不知所蹤!!但武林中聽說有人曾經聽聞過此事...\n");
   }
  else if (this_player()->query("class")=="scholar")
    {
    this_player()->set_temp("swordquest/findball",1);
    return ("麗玉蝶蘭晶珠，是傳說中靈筆麗玉碟蘭的靈力之源，然則，因逍遙子拿他作為開天三才陣的封印因此從靈筆中被抽出，現在已不知所蹤!!但武林中聽說有人曾經聽聞過此事...\n");
   }
else return ("對不起﹐你問的事我實在沒有印象。");
 }
}
string liyu()
{
if(this_player()->query("liyu")==0)
{
command("say 啥...你說啥?? ");
}
else
{
command("say 此乃開天三靈器之一的靈筆，當初乃劍師龍鐵心由仙劍連陽所分鑄而出，只知當初是傳給儒門，不過，在儒門大變之後，被七星塔的七個土匪所偷走....只是不知道他們把他拿到哪去....");
this_player()->set("liyu",2);
}
}
void create()
{
	set_name("諸葛臥龍",({"master dguger","dguger"}));
	set("gender","男性");
	set("title","神算先生");
	set("combat_exp",100);

	set("attitude","heroism");
	set("age",27);
	set("no_answer",1);
	set("inquiry",([
	"去老還童術" : "相傳去老還童之法有二﹐一者乃是收集「鎖元盒」以及「青龍之氣」﹐利用鎖元盒將自身元力保存﹐再利用青龍之氣再生的神力將自身狀況回復到年輕時代﹐之後再將鎖元盒內的元力放回﹐另外一法則是修練「玄子神功」﹐此法乃創始於西漢張天師﹐修練此法可使" +
	"驅體有去舊還新之能也﹐惟此法難學﹐且會的的人不多。\n",
        "麗玉蝶蘭" : (: liyu :),
	"青龍之氣" : "相傳此氣乃天庭青龍所化﹐具有保衛主人及將物品恢復原狀之能﹐據我所知﹐能召喚此青龍者﹐惟有儒門的青龍之笛。\n",
	"玄子神功" : "此乃由西漢張陵所創之絕技﹐修練此法必須消耗極多的內力﹐而此法之作用主要是能夠使人去老還童。\n",
	"保持自身元力" : "此乃「鎖元盒」之特殊功能也﹐當今世上也只有仙雲山上的高人知道他的用法。\n",
	"姜子牙" : "此人乃商朝名人﹐曾輔佐周武王平定暴君紂王。\n",
	"九陽真火" : "九陽真火有名天火﹐乃天庭之火也﹐此火水澆不熄﹐風吹不滅。\n",
	"未來" : (: check_future :),
//     "天母峰" : "此地在西疆一帶﹐又名「聖母峰」﹐山中有些許特殊的礦物。\n",
	"天母石" : "此物產於西疆一帶的天母峰﹐相傳雪蒼也有一顆﹐後更其名為「天邪石」。\n",
	"天邪石" : "此即「天母石」也﹐乃雪蒼派第三代獨孤愁遠赴西疆帶回﹐現今亦在雪蒼。\n",
	"盜走之人" : "此天機也... 汝日自可得知。\n",
	"青龍之笛" : "此乃可以召喚青龍之物﹐相傳此物落入儒門之中。\n",
	"張天師" : "此人本名張陵﹐後修練符法﹐成為道教的創始人。\n",
	"張陵" : "此人人稱張天師﹐生於西漢﹐擅於使用符法。\n",
//     "符法" : "符法乃創始於西漢張陵﹐相傳符法有許多不可思議之處﹐如驅魔伏妖、點石成金、穿梭時空等等。\n",
	"驅魔伏妖" : "此乃符法之最主要功能﹐主要是用萊驅除一些危害人類的妖魔。\n",
	"點石成金" : "此能符法之騙術之一﹐事實上是用障眼法來瞞住一般人的眼睛﹐並非真正將石頭變成黃金﹐但是此障眼之術也頗為神奇﹐不可忽視。\n",
	"穿梭時空" : "此乃符法中最上乘之密法﹐可使人回到過去的時空﹐但是施行此法必需耗費一甲子的功力。\n",
	"鄭士欣" : "此人乃是仙劍派的掌門人﹐道號「無極真人」﹐是武林人士所公認的天下第一高手、以及第一劍客﹐武功之高﹐匪夷所思﹐惟其年紀漸長﹐功力已不如年輕時那般強勁﹐而其門下則有弟子七人﹐合稱「仙劍七俠」﹐武功亦是不弱。\n",
	"莫測" : "此人乃武林四大高手之一﹐人稱「魔刀」﹐在天下所有用刀高手之中排行第一﹐為人十分爽直﹐但與雪蒼派的獨孤愁有些過節﹐曾發生多次的衝突﹐後來在十年前就消失於武林﹐不知去向。\n",
	"獨孤愁" : "此人乃是武林四大高手之一﹐外號「雪掌」﹐此人掌法精絕﹐有「天下第一掌」之稱﹐此外此人又飽讀詩書﹐經通諸子百家之書﹐文武雙全﹐曾經稱霸武林有很長的一段時日﹐而據傳聞﹐此人因修行雪蒼派密招而走火入魔身亡﹐遺有一子﹐名「雲」。",
	"邢千書" : "此人在二十年前以一手的「儒門幻指」威鎮武林﹐人稱「幻指」﹐又稱「指劍才子」﹐乃是武林四大高手之一﹐後來在二十年前﹐受好友獨孤愁之託﹐守護雪蒼派至寶「鎖元盒」﹐不幸被來路不明的幾個高手所殺﹐遺有一子﹐名曰「賢書」。\n",
	"四大高手" : "武林之四大高手乃是「仙劍」鄭士欣、「魔刀」莫測、「雪掌」獨孤愁、「幻指」邢千書等四人。\n",
	"儒門幻指" : "此乃儒門代代相同的絕學﹐可惜在邢千書死後就已失傳。\n",
	"獨孤雲" : "此人複姓獨孤名雲﹐乃雪蒼派名人獨孤愁之子﹐武功亦是不凡﹐且此人承襲其父教誨﹐亦是飽讀經史﹐有「全才書生」的美譽。\n",
	"無極真人" : "乃仙劍鄭士欣也。\n",
	"全才書生" : "此人乃雪蒼派後起之秀﹐獨孤愁之子獨孤雲。\n",
	"邢賢書" : "此人乃儒門一代高手邢千書之子﹐與吾為故交。\n",
	"聖賢書" : "此人原名邢賢書﹐後更姓而為聖賢書﹐乃吾故交好友。\n",
	"劉全書" : "此人外號「黑影鬼腳」﹐乃是雪蒼派現任掌門人﹐武功亦是不凡﹐與雪蒼派王魁、星斗宿合稱雪蒼三俠。\n",
	"王魁" : "此人乃雪蒼派劉全書之師弟﹐為雪蒼三俠之一。\n",
	"星斗宿" : "此人乃雪蒼派劉全書之師弟﹐為雪蒼三俠之一﹐擅觀星相﹐精通陣法。\n",
	"雪蒼三俠" : "雪蒼三俠指的是劉全書、王魁、星斗宿等三人。\n",
	"陸小雙" : "此人乃一代奇才﹐人稱「刀劍雙絕」﹐刀法、劍術皆稱一流﹐相傳其刀法乃魔刀所傳﹐劍法學自鄭士欣﹐曾經跟隨隨獨孤愁﹐後來獨孤愁死後則下落不明。\n",
	"葉秀殺" : "此人乃是殺手組織「黑牙聯」的首腦﹐天生就是一個啞吧﹐擅於使用暗器﹐暗殺過無數英雄豪傑。\n",
	"風采鈴" : "此人天生麗質﹐貌美若仙﹐是武林中罕見的美女﹐人稱「琴舞雙絕」﹐擅長音樂及舞蹈﹐和陸小雙並稱「二絕」。\n",
	"二絕" : "二絕指的是「刀劍雙絕」陸小雙﹐以及「琴舞雙絕」風采鈴。\n",
	"莊靜柔" : "此人乃是冥蠱魔教教主﹐為人陰險﹐擅使毒﹐武林中人皆懼怕她三分。\n",
        "李夢枕" : "此人為金風細雨樓樓主﹐近年來已從武林中消失..\n",
        "開天三才陣" : "這個陣法聽說是當年逍遙子用來困血魔的...不過直至現今..仍無人得見\n",
        "天門奇陣" : (: a_array :),
        "晶珠" : (:ask_ball:),
		]));
	setup();
}

int accept_fight( object who )
{
	command("say 逞強鬥勇非智者所為也。");
	return 0;
}
int accept_kill( object who )
{
	command("say 殺了我對你並沒有好處。");
	return 0;
}
int do_say( object me )
{
	if( !me->query("quests/find_dguger") ) {
		command("say 閣下光臨此地﹐諸葛某有失遠迎﹐幸會幸會。");
		me->set("quests/find_dguger",1);
		return 1;
	}
	command("say 閣下再度光臨寒舍﹐不知有何指教 ?");
}
void init()
{
	object me = this_player();
	call_out("do_say",1,me);
	add_action("do_ask","ask");
}

int do_ask( string arg )
{
	if( !arg || sscanf(arg,"dguger about %s",arg) != 1 ) return 0;
	if( !query("inquiry/"+arg) ) {
		command("say 天機不可洩漏也....。");
		return 1;
	}
	command("say "+query("inquiry/"+arg));
	return 1;
}
