// n_area.h by konn

string *n_area_msg = ({

// n_area0.c
    "這裡是通往南鎮城的重要通道, 人來人往熱鬧非凡, 狹窄的街道已被擠得水\n"+
    "泄不通, 北方則是聞名天下的金刀門, 若您往東走可到達楓林港口, 往南行\n"+
    "則可至中央廣場, 愈南愈充滿了神秘的色彩。\n\n",

// n_area1.c
    "只見商人們成群結隊的從這裡徐徐而過, 小販的叫賣聲, 讓你覺得這裡真是\n"+
    "個繁榮的地方啊! 觀光的旅客亦不少, 個個身穿華麗的衣裳, 走在街上更覺\n"+
    "得炫目耀眼, 一陣清風而過, 你更感到神清氣爽。\n\n",

// n_area2.c
    "此處是個歇息賞景的好地方, 遠眺青山, 耳聽鳥鳴, 心中有說不出的輕鬆愉\n"+
    "快, 頭頂跚\跚\飛過的雁兒, 更點綴了輕鬆愜意的畫面, 站在這裡向小販討了\n"+
    "碗水喝, 擦擦額頭的汗漬, 也該準備啟程了。\n\n",

// n_area3.c
    "由此處望南而去, 便是中央廣場了, 那裡可是全國屬一屬二的繁華地區, 那\n"+
    "裡最出名的土產便是紅茶了, 聽說連當今天子都喜歡喝那裡所出產的紅茶, \n"+
    "您何不也到那裡品嚐品嚐呢? \n\n",

// n_area4.c
    "到這裡已漸漸安靜下來, 沒有西大街東半部如此的喧嘩嘈雜, 但旅人依然不\n"+
    "少, 你可以悠閒的在這裡散步著, 從這裡往東而去, 便是這鬧非凡的西大街\n"+
    "往西行去, 則是進入鮮有人跡的鄉下地方。\n\n",

// n_area5.c
    "當你尚未到達此處時, 老遠就看到一老一少兩丐蹲在這裡, 老的約七八十歲\n"+
    "了, 小的大約只有六七歲, 不知道什麼原因使得他們得沿街乞討為生, 看他\n"+
    "老少兩人面黃肌瘦的, 就發個慈悲心賞幾個子兒給他們吧!\n\n",

// n_area6.c
    "沿途走來發覺人煙已漸漸稀少, 偶而看到幾位頑童在路邊玩耍嬉鬧著, 由\n"+
    "此再往南而下已算是鄉下地方, 住家也只也兩三戶而已, 或您想買些什麼\n"+
    "東西的話, 相信往東走會是比較好的選擇。\n\n",

// n_area7.c
    "在這裡你可以看到鄉下人的純樸生活, 將他們與富貴人家相比, 更顯出他\n"+
    "們的樸實, 只見到三兩隻山雞在你身邊不遠處在找尋著食物, 一步一啄的\n"+
    "慢慢地找著, 東邊就是一家民房, 西邊則是一片小山坡。\n\n",

// n_area8.c
    "這裡是一個凸起的小山坡, 只見滿地都是野薑花, 參雜著一些含羞草, 站\n"+
    "在這裡往東一看, 一棟民房座落在山坡不遠處, 屋頂是以片片棕紅瓦片所\n"+
    "蓋\, 遠遠望去像是一片楓樹林。\n\n",

// n_area9.c
    "走到這裡, 向前已經沒有路了, 只見前面一片樹林, 蔥翠的樹木半遮著森\n"+
    "林的一條小路, 往西而去也是樹林一片, 這裡離開了繁華熱鬧的市區, 讓\n"+
    "你感到十分的舒暢, 但又覺得不太習慣。\n\n",

// n_area10.c
    "這裡是一大片樹林, 茂密的樹葉將光線遮住了, 使你看不清你現在的位置\n"+
    ", 聽得腳底下一些不知名的蟲兒嘰嘰、嘰嘰的叫著, 配合著節奏的韻律, \n"+
    "到也滿有趣的, 但這個地方不適合久留啊。\n\n",

// n_area11.c
    "這裡是一片原始森林, 樹木長得又茂盛又翠綠, 在這裡不但可以避開外頭\n"+
    "那酷熱的陽光, 又可以在這裡睡個午覺, 豈不妙哉? 但這裡卻是猛獸時常\n"+
    "出沒的地方, 還是小心點好。\n\n",

// n_area12.c
    "濃密的草木擋住了前方的去路, 遠方一思幽幽的光線照了過來, 前面好像\n"+
    "有住家的樣子, 你心裡一陣低咕「誰會住在這種地方呢? 」你不禁想向前\n"+
    "走去好探個究竟。\n\n",

// n_area13.c
    "這座洞窟結構像是天然所形成的, 這裡住了一位為了避世的世外高人, 他\n"+
    "就是當今朝庭的國師, 因曾數次與皇上意見相突, 又遭小人毀謗, 因此隱\n"+
    "居在這小山洞裡, 不問世事。這洞裡的中央擺\了一張青石板所磨製的桌子\n"+
    ", 另加幾張石椅, 角落則放了一張木床, 洞裡冬暖夏涼, 極為舒適。\n\n",

// n_area14.c

    "\n\n",

// n_area15.c

    "\n\n",

// n_area16.c

    "\n\n",

// n_area17.c

    "\n\n",

// n_area18.c

    "\n\n",

// n_area19.c

    "\n\n",

// n_area20.c

    "\n\n",

// n_area21.c

    "\n\n",

// n_area22.c

    "\n\n",

// n_area23.c

    "\n\n",

// n_area24.c

    "\n\n",

// n_area25.c

    "\n\n",

// n_area26.c

    "\n\n",

// n_area27.c

    "\n\n",

// n_area28.c

    "\n\n",

// n_area29.c

    "\n\n",

// n_area30.c

    "\n\n",

// n_area31.c

    "\n\n",

// n_area32.c

    "\n\n",

// n_area33.c

    "\n\n",

// n_area34.c

    "\n\n",

// n_area35.c

    "\n\n",

// n_area36.c

    "\n\n",

// n_area37.c

    "\n\n",

// n_area38.c

    "\n\n",

// n_area39.c

    "\n\n",

// n_area40.c

    "\n\n",

// n_area41.c

    "\n\n",

// n_area42.c

    "\n\n",

// n_area43.c

    "\n\n",

// n_area44.c

    "\n\n",

// n_area45.c

    "\n\n",

// n_area46.c

    "\n\n",

// n_area47.c

    "\n\n",

// n_area48.c

    "\n\n",

// n_area49.c

    "\n\n",

// n_area50.c

    "\n\n",

// n_area51.c

    "\n\n",

// n_area52.c

    "\n\n",

// n_area53.c

    "\n\n",

// n_area54.c

    "\n\n",

// n_area55.c

    "\n\n",

// n_area56.c

    "\n\n",

// n_area57.c

    "\n\n",

// n_area58.c

    "\n\n",

// n_area59.c

    "\n\n",

// n_area60.c

    "\n\n",

// n_area61.c

    "\n\n",

// n_area62.c

    "\n\n",

// n_area63.c

    "\n\n",

// n_area64.c

    "\n\n",

// n_area65.c

    "\n\n",

// n_area66.c

    "\n\n",
});

string n_area(int i)
{   return n_area_msg[i];   }

