inherit ROOM;
void create() {
	set( "short", "望月醉臥亭" );
	set( "build", 13833 );
	set( "light_up", 1 );
	set( "exits", ([
		"out"       : "/open/clan/13_luck/room/room96.c",
		"north"     : "/open/clan/13_luck/room/room165.c",
	]) );
	set( "long", @LONG

　　此為入望月樓的必經之路，也在此能觀看姣潔的月光，而被小南
命名為望月樓，除了觀看月光外，還有可以看到被幫眾命名的十三吉
祥八位傳說中的高手，何稱吉祥八煞。
    
　　　┌─　　十三吉祥傳說中的八大高手　　─┐
　　　│　　　　此後幫人合稱吉祥八煞　　　　│
　　　├──────────────────┤
　　　│霸者之道－不敗傳說  　　小南　　　　│
　　　│傲世三俠－龍無情　　　　龍　　　　　│
　　　│阿修羅界－武者之魂　　　寒紫星　　　│
　　　│仁者無敵－殺手之皇　　　小東邪　　　│
　　　│火影至尊－聖火天皇　　　狂˙影　　　│
　　　│笑傲天蒼－射日霸者　　　狂龍　　　　│
　　　│無極霸刀－浪跡天涯　　　風魔浪子　　│
　　　│道迦盈鋒－冥月道使　　　大杯綠茶　　│
　　　└──────────────────┘ 

LONG);
	setup();
	replace_program(ROOM);
}
