inherit ROOM;
void create() {
	set( "short", "龍族神道入口" );
	set( "owner", "shinny" );
	set( "exits", ([
		"east"      : "/open/clan/13_luck/room/room655",
	]) );
	set( "long", @LONG
這裡是龍族神道的通往禁地起點，常人是不能來的，就連絕世高手
也不一定能輕易進去，塔內有著守衛護法，想過去除了必須打倒他
們外，還要經過智慧的考驗。通往禁地的路途上困難重重，凡我幫
眾通過此一鍛鍊，必然成為我幫之大器，並可成為智勇雙全之士。
前方的路途坎坷岐嶇，希望各位闖關勇者拿出最佳的勇氣向前去吧
                                  ◢  ◢◣
                                    ◢█◢██
                                ◢██████
                        ◢████████  ◤
                      ◢█◤● ◢████◤◣
               ◢████████████◤   ▍
               ██████████████◤  ▍
                 ◥  ◥ ◥ ██████◤  ─ ▍
    ◢█▇▆▅▄▂▁▁▁▁▁██████◣ ─ ▍
（  ◥███▆▅▄▃▂▁▁▁██◥███◣ ─ ▍
  ）◢███████◢◢◢█████◥ ─ ─ ▍
    ◥██████  ██◤█  █ ─ ─ ─ ▍
（  ◢█████◤  ██◤  ─ ─ ─ ▍
  ）◥███◤◥██◤   ██ ─ ─ ─ ▍
                            ██ ─ ─ ─ ▍
                            ██─ ─ ─ ─▍
                            ██ ─ ─ ─  ▌

LONG);
	setup();
	replace_program(ROOM);
}
