inherit ROOM;
void create() {
	set( "short", "吉祥天地樓" );
	set( "build", 10539 );
	set( "exits", ([
		"north"     : "/open/clan/13_luck/room/room181.c",
		"south"     : "/open/clan/13_luck/room/room164.c",
	]) );
	set( "light_up", 1 );
	set( "long", @LONG

    此樓為傳說中的幫主小南所設立的，在傳說變態的小南，以萬夫莫敵的
姿態，傲視群雄，可能是霸刀看太多了所以創立了十三吉祥，就也是十三吉
祥的由來，尤其是自行獨創的太極拳，完全符合一進此樓的超大匾額中的字
希望以後幫眾  他強由他強  清風彿山崗 他橫由他橫 明月照大江
               oooo$o$$$$$$$$$$
                $$$$$$$$$$$$$$
                 $$$$  o$$$$  
                  oo$$$$$   
                   $$$$$$$  ooooo  
                     $$$$$$$ $$$$$o 
                 oo$$$$$$  o$$$$$$$ 
             oo$$$$$$$$$$$$$$$$$    
           $$$$$$$$$$$$$$$$$     
                 o$$$$ $$$$$  
               o$$$  oo$$$$$      oo 
                     $$$$$$$o$$$$$$$$$ 
                ooo$$$$$$$$$$$$$$$$$$$ 
          oooo$$$$$$$$$$$$$         
       $$$$$$$$$$$$   $$$$$$ oo$oo   
         $$$$$$$$$$o  $$$$$o  $$$$$o 
              $$$$$   $$$$$$   $$$$$$ 
              $$$$    $$$$$$    $$$$  
                   $$$$$$$$             

LONG);
	setup();
	replace_program(ROOM);
}
