// story:niulang 牛郎織女

#include <ansi.h>

string give_gift();

private mixed *story = ({
        "七月初七，鵲橋相會。",
        "喜鵲飛呀飛～～～",
        "織女：牛郎哥哥，你可想死我了。",
        "牛郎：織女妹妹，我也很想你啊，這一年來我無時無刻不在思念你啊。",
        "織女：唉，春去秋來總依舊，分分離離何時了。",
        "牛郎哽咽道：我的好老婆啊...",
        "王母娘娘：這兩個傢伙，酸死我了，那個... 那個賤人！",
        "智多星：王母息怒，少忍，少忍。",
        "牛郎和織女猶在卿卿我我。",
        "驀然織女大怒，手裡掐著一根頭髮，喝道：牛郎，你快給我說清楚，這是哪兒來的？",
        "牛郎結結巴巴道：老婆... 這，這是不是你的啊？",
        "織女冷笑道：哼！我的頭髮可不是這個樣子的，這頭髮分明是一個凡人的！",
        "牛郎頭裡嗡嗡直叫。",
        "織女猛搖牛郎，喊道：你快給我說清楚！說清楚呀！",
        "牛郎喃喃道：我，我這是跳到銀河裡也洗不清了。",
        "織女淡然道：好，你就跳到銀河裡吧，如果你跳了，我就認為你是清白的。",
        "牛郎苦著臉道：老婆，你這不是要害死我嘛，這，我這跳進去，不立刻變成冰棍了。",
        "織女大怒，給牛郎就是一耳光，「啪」的一聲異常響亮，喝道：滾，我不是你老婆！",
        "織女飄然而去，渺然不見蹤影",
        "牛郎捂著臉，半晌才清醒過來，嘀咕道：他奶奶的，這婊子，沒點三從四德，休了她！",
        "牛郎低頭踉踉蹌蹌而去。",
        "智多星：怎麼樣，王母娘娘，小人這條計還算不錯吧。",
        "王母娘娘頜然讚許\道：你小子不賴，難怪能做上梁山第三把交椅，有點門道。",
        "王母娘娘又說道：我獎你萬年靈芝一棵。說著扔了一棵萬年靈芝給智多星。",
        "智多星心裡一高興，腳下一滑，靈芝掉下了凡間....",
        "喜鵲飛呀飛～～～",
        (: give_gift :)
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
        STORY_D->give_gift("/obj/gift/lingzhi", 1,
                           HIM + "\n「啪」的一聲一棵萬年靈芝掉到你面前。\n\n" + NOR);
        return HIM + "聽說天庭遺落一棵萬年靈芝。\n" + NOR;
}
