// Room: /open/wu/room/luroom1.c
// 瀧山武館的大門
#include <ansi.h>
#include <room.h>
inherit ROOM;

void create ()
{
  set ("short", "瀧山武館大門");
  set ("long", @LONG
                 ◣                        ◢
                   ║■■■■■■■■■■■■■■║
                ◢═════════════════◣
                 ║田田║田田║  田田  ║田田║田田║
        ◢■■■■■■■■■■■■■■■■■■■■■■■■■
         ▕════════════════════════▏
          ▔█田田田田田田田 瀧  山  武  館 田田田田田田█▔
             █|田田田田田田田田田田田田田田田田田田田|█
              █│     ∥∥                 ∥∥      █ 
             _█│ 田  ║║ 田  │▉▉│ 田 ║║  田  █
              █│     ▉▉     │▉▉│    ▉▉      █

你正站在一座建築宏偉的宅第之前, 左右兩座石壇中各豎一根兩丈
來高的旗杆, 杆頂飄揚著青旗, 旗上繡著"瀧山武館"四個黑字,大宅生
漆大門,門上茶杯大小的金環閃閃發光,門頂匾額寫著"拳傾天下"四個金
漆大字,門口有二位威風八面的武師鎮守,眼晴發出雄雄的目光,向四週
巡示。
LONG);

  set("exits", ([ /* sizeof() == 2 */
  "west" : "/open/ping/room/inn",
  "east" : __DIR__"luroom3",
]));
  set("light_up", 1);
  set("objects", ([ /* sizeof() == 1 */
  "/open/wu/npc/g_fighter" : 2,
]));

  setup();
}
