// Room: /u/o/onion/room/d_room0.c

#include <room.h>
inherit ROOM;

void create()
{
	set("short", "院子");
	set("long", @LONG
院子裡到處種滿了花草,尤其是各式各樣的茶花,品種繁多,色彩繽紛,令人目不暇給.
這裡的主人必定十分喜愛茶花(flower).
    東邊有一棟精巧兩層樓建築的小樓,上頭還雕了一頭形態神似的鳳凰.
    西邊有一扇小紅門(door).	
LONG
	);
	set("exits", ([ /* sizeof() == 2 */
  "west" : __DIR__"room6",
  "east" : __DIR__"d_room1",
]));
        set("item_desc", ([ /* sizeof() == 1 */
        "flower" : 
"
        .-~~-.--.
       :         )
 .~ ~ -.＼      /.- ~~ .
 >       .   .'       <
(         .- -.         )
 - -.-~  - -'  ~-.- -'
   (        :        )           _ _ .-:
    ~--.    :    .--~        .-~  .-~  }
        ~-.-^-.-~ ＼_      .~  .-~   .~
                 ＼＼'     ＼'_ _ -~
                  ..    //
         . - ~ ~-.__.-.//
     .-~   . - ~  }~ ~ ~-.~-.
   .' .-~      .-~       :/~-.~-./:
  /_~_ _ . - ~                 ~-.~-._
                                   ~-.<

你湊上去仔細的瞧一瞧,發現此地的茶花實在是精品啊...\n",
	"door" : "一扇精巧的小紅門,可以從門中看到另一邊的景色.\n",
        ]));
        create_door("west","小紅門","east",DOOR_CLOSED);
                                 
	setup();
}
