// copy from /d/snow/npc/teacher.c

inherit NPC;

void create()
{
	set_name("滿身酒味的老翁", ({ "drunkard"}) );
	set("gender", "男性" );
	set("age", 63);
	set("int", 26);
set("long","他醉臥床上，雙手還抱一個大酒罈，拼命的把酒往嘴裡罐，一張臉紅得發紫
，身上散發出濃厚的酒味，嘴中還不時喃喃自語。\n");
        set("inquiry",([
        "禁地":"你是誰！！禁地的事我一概不知，就算知道不會告訴你，你走吧。\n",
      "逍遙子":"逍遙子是我們仙劍派的祖師爺，喜愛打抱不平，見人有難，必定拔刀相
助。當年大魔頭率領大批妖眾，將整個武林弄的腥風血雨，最後還是靠他才得免除了這場
浩劫，不過經過那次戰役，他也大傷真元，從此退出武林。據說他到現在還沒死，有緣人
若遇見他，說不定還能蒙他傳上幾項功\夫。\n",
        "天魔":"他可是一個殺人不眨眼的魔頭，據說當年一役，他並沒死，只是被逍遙
子給封印起來了。\n",
        "封印":"我累了,你去問我的師弟吧\n"]));
	set("combat_exp",50000);
        set("max_kee",500);
        set("max_gin",500);                        
	set_skill("unarmed",50);
	set_skill("parry",50);
	set_skill("force",50);
	setup();
   }

