// copy from /d/snow/npc/teacher.c

inherit NPC;

void create()
{
	set_name("滿身酒味的老翁", ({ "drunkard"}) );
	set("gender", "男性" );
	set("age", 63);
	set("int", 26);
set("long","他醉臥床上，雙手還抱一個大酒罈，拼命的把酒往嘴裡罐，一張臉紅得發紫
，身上散發出濃厚的酒味，嘴中還不時喃喃自語。\n");
        set("inquiry",([
        "禁地":"你是誰！！禁地的事我一概不知，就算知道不會告訴你，你走吧。\n",
      "逍遙子":"逍遙子是我們仙劍派的祖師爺，喜愛打抱不平，見人有難，必定拔刀相
助。當年大魔頭率領大批妖眾，將整個武林弄的腥風血雨，最後還是靠他才得免除了這場
浩劫，不過經過那次戰役，他也大傷真元，從此退出武林。據說他到現在還沒死，有緣人
若遇見他，說不定還能蒙他傳上幾項功\夫。\n",
        "天魔":"他可是一個殺人不眨眼的魔頭，據說當年一役，死後藉血氣化身....
後世稱其為血魔...不過當時的據說有一位前輩受祖師爺的指導後一起去挑戰血魔..
從此祖師..前輩血魔都銷聲匿跡了.....\n",
        "開天三才陣":"不知道ㄝ~，不過據說武林之中只有一個人知道其中奧秘\n",
        "一個人":"在我還是仙劍門徒時,我曾經聽說在魔域有一個人知道開天三才陣的
        奧祕但是,無人知道他在魔域的哪裡\n",
        "魔域" : "七星塔為魔域與現實世界的連接處..你可以去那調查一下"
        ]));
	set("combat_exp",50000);
        set("max_kee",500);
        set("max_gin",500);                        
	set_skill("unarmed",50);
	set_skill("parry",50);
	set_skill("force",50);
	setup();
   }

