 inherit NPC;

void create()
{
        set_name("周老",({"chou"}));
        set("long",@LONG
年少就躬耕於農的他，可以清楚看到他身上被歷年烈陽所灼傷的
肌膚，所以年紀不到三十的他，已經看起來有五十多的年紀，而困擾
中的他，更顯的蒼老．．．。
LONG);
        set("age",34);
        set("gender","男性");
        set("con",10);
        set("str",10);
        set("combat_exp",10);
        set("inquiry",([
"困擾":"我那婆子生下了一個男嬰，本是一件值得高興的事情，可是．．．那
孩子一出生就染到了很奇怪的怪病．．．唉唉～\n",

"怪病":"怪病一發作，那孩子就抖個不停～本想找個大夫來幫孩子看病，可是
家裡面並沒有足夠的錢能請個大夫過來．．．\n",

"錢":"老子並不想要錢，只想請個大夫過來幫小兒看個病～\n",

"大夫":"聽說有個行腳大夫目前正在華駝大夫那邊呆著，真希望他做個功\德，
來幫我小兒看一下病．．．\n",

"行腳大夫":"我對他並不清楚，不過聽鄰居說他正住在華駝大夫那．．．\n",

"華駝大夫":"聽說他有設個行館在楓林港那．．．其他的事情老子就不太清楚了．．．\n",

]));
        setup();
}
