// Room: /open/su/room/suroad9_1.c

inherit ROOM;

void create()
{
set("short","仙劍派前山");
	set("long", @LONG
只見山峰穿雲插天，山石滑溜，寸草不生，左邊有一片大瀑布(waterfall)
從天而降,詩人李白所說之黃河之水天上來,恐也無法與之媲美，右邊有著
一棟廢棄的茅草屋(house)。
LONG
	);
set("item_desc",(["waterfall":
        "一道從天而降的大瀑布，水流極其湍急，仔細一瞧瀑布底似乎另有蹊竅,\n
        你忍不住想下去探個究竟(swim)..\n",
                   "house":
        "一棟殘破不堪的茅草屋，仔細的搜尋(search)一下，可能有驚人的發現...\n"]));                           
  set("outdoors", "/open/gsword");
 set("exits",([
"south":__DIR__"mroom7",
  "north":__DIR__"road4",
"west":__DIR__"lroad1",
"east":__DIR__"rroad1"
 ]));
 setup();
 }
  void init(){
  add_action("search_house","search");
  add_action("swim_waterfall","swim");}
  int search_house(string str) {
       if (str!="house") {
                 return 0;}
       write("         你聽到一陣震耳欲聾的機關聲，天啊!!!竟有一艘鐵船緩緩駛出!!!
          .........................................................
          .........................................................
          .........................................................
              
          你手劃十字，大喊:媽啊!!請保佑我吧!!縱身跳上鐵船..........
          ........................................................
          ........................................................
          ........................................................
          
          
         
         ");
       this_player()->move("/open/gsword/room/ship");
         return 1;
         setup();
         }
  int swim_waterfall(string arg) {
      if (arg!="waterfall") {
          return 0;
           }
       write("你秉氣凝神，吸了一大口氣，縱身向池底游去
              .....................................
              .....................................
              .....................................
              .....................................
              .....................................
              .....................................\n"
              
              
              
              
              
              
              );
       this_player()->move("/open/gsword/room/pool");
       return 1;
       }           

