#include <room.h>

 inherit ROOM;

 void create()
{
        set("short", "仙劍派大門");
        set("long", @LONG
                                                                    
      ˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍˍ     
    ▕   ▕                                                       ▕   ▕
 ﹏ ▕   ▕      ╭╯   ║         ╭╮       ║       ╭╯╭     ▕   ▕  ﹏
    ▕   ▕    ╭╯     ║       ╭╯╰╮     ║   ╮  ╯╭╯     ▕   ▕ 
    ▕   ▕  ╭╯║     ║     ╭╯══╰╮║ ║   ╰             ▕   ▕  ﹏
    ▕   ▕      ║     ║       ─╖ ─╖ ║ ║   ╮ ║ ║       ▕   ▕
  ﹏▕   ▕      ║     ║      ║ ║║ ║    ║   ╰ ║ ║ ╮ ● ▕   ▕     
    ▕   ▕      ║ ║  ║  ║  ╙─ ╙─     ║      ║ ║ ╰╮  ▕   ▕   ﹏
    ▕   ▕      ║ ╰═╩═╯  ╭ ╮╭ ╮    ║   ╭ ║ ║   ╰╮▕   ▕
 ﹏ ▕   ▕                               	                  ▕   ▕
    ▕ ￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣▕    
    ▕   ▕                                                       ▕   ▕
    ▕   ▕                                                       ▕   ▕
    ▕   ▕                                                       ▕   ▕
    ▕   ▕                                                       ▕   ▕
    ▕   ▕                                                       ▕   ▕
    ▕   ▕                                                       ▕   ▕ 
    ▕   ▕                                                       ▕   ▕                        
    ▕   ▕                                                       ▕   ▕
     
LONG
        );

        set("exits", ([
		"down": "/u/b/bigcat/room/road8",
        ]) );
setup();

}
