當巫師第一步要先知道四件事:

   1. 檢查自己的心態
	一般來說, 當巫師是為了進一步對 mud 有貢獻, 對 mud 進一步了解其運作機制
	但是有人是在玩 mud 時不知道怎麼解謎, 不知道怎麼快速升級才當巫師, 通常
	這種人不論在哪一個 mud 都被列為不受歡迎的巫師, 因此檢查自己的心態是很
	重要的. 在檢查自己的心態時, 當然也得檢查自己是不是跟本 mud 的架站理念
	一致, 如果是, 那相信會相處愉快. 如果不是, 那就得考慮考慮是否應該繼續當
	巫師. 關於狂想空間架站理念, 請用 help mud_idea 查看.

   2. 熟悉巫師規則
	一般來說, 巫師的角色在於讓系統穩定發展, 創造發明與維護架站理念是所有巫
	師共同的職責. 當一個新手巫師, 也許您最想做的是寫程式, 修改自己的資料等
	等神乎其技的能力, 但是, 對一個 mud 來說, 遵守規則卻是最最重要的工作.
	也許您看了底下的規則, 會說, 那當巫師還有什麼尊嚴? 沒錯, 這個問題問的好,
	請您仔細想想, 當巫師的尊嚴何在?!
	a.巫師也是人, 我們都有自己正常的生活要過, 因此, 在不影響您的作息的情況
	  之下, 希望您能常常在此露面, 我想, 以一個月為標準應該不會很過份. 值得
	  注意的是, 就算您很忙, 在一個月內上線一次, 露露面應該不會很過份才對.
	  如果超過一個月沒上線, 除了大巫師級以外, 將視為不適合當巫師來看, 通
	  常會降級, 或取消其 boss, 等等. 這項工作通常由其 boss 來做.
	b.巫師的角色並不是為了在玩 mud 時幫助自己或者是其他玩家的. 之所以這樣
	  規定的原因, 是一旦您幫助玩家, 將會使該名玩家喪失當玩家的樂趣. 就長期
	  來說, 幫助玩家並不是一個很好的行為. 其次, 這也將造成本 mud 的嚴重傷
	  害, 因此, 觸犯此規則的人, 通常都是砍檔處份.
	c.不得做出危害本 mud 的行為. 除了上述兩項, 其他如: 砍死玩家, 在開放區
	  砍 mob(要測試請在非開放區做), 或者跟 player 對罵, 用巫師的角色迫害或
	  威脅玩家, 或者宣揚不利於本 mud 的不當言論等等. 此項規則通常是告訴乃
	  論, 一旦引起爭議時, 在沒有合理的解釋下, 輕則口頭或書面警告, 重則砍檔

   3. 熟悉巫師的命令
	巫師可以用的所有命令可以用 help wizcmds 來查
	最重要的是檔案的操作, 這一點請用 help file_oper 來看. 
	另外值得特別提出的有幾項命令:
	a.ftp: 這不是命令, 但是是很重要的能力, 如果您不會在線上編輯檔案, 則您
		一定要會 ftp, 請用 help ftp 查看進一步的說明
	b.call: 這是最常觸犯巫師規則的命令之一, call 可以用來改資料, 通常是為
		了給巫師隨時調整 mob 強弱等資料, 以方便 mud 的進行, 但是巫師
		們卻常常拿來修改自己或者是玩家資料, 以這點來說, 這是非常危險的,
		因為, 也許會因此被砍掉檔案.

   4. 讀文件
	所謂的文件包括範圍很廣, 例如區域的檔案, 裝備武器怪物等等, 還有的就是
	命令的使用方式, 程式的寫作方法等等, 最常用來讀文件的方式是用 help 命
	令. help 除了可以查命令用法, 也可以看很多東西, 當然您要知道參數, 此
	外也可以用來查函數的寫法. 無論如何, 絕大多數的說明文件都是放在 /doc
	這個目錄下, 請您自行整理並閱讀. 關於如何寫程式, 也可以用實例來學, 也
	就是用 more here, more board 等等方式來查看檔案的寫法, 請用 help more
	取得有關 more 用法的進一步說明. 要會讀文件當然需要檔案的操作, 請您先
	學會檔案操作.

接下來, 談談有哪些工作可以做:
01. 寫區域, 這點, 雖然說在這個 mud  人人平等, 但是人的力量與時間總是有限,
    因此勸各位早日加入某大巫師的行列, 讓自己成長的快一點, 也能讓自己的理想
    早日實現. 一個區域最重要的是: 理念, 沒有理念的區域大概只有一種用途: 撐
    場面, 相信沒有人是希望這樣的, 至於你的理念是啥倒是見仁見智的了, 可以是
    為了低等級的玩家練功, 可以是給高等級玩家挑戰, 也可以是給人解 quests..
    談到寫區域, 有幾件事要說說. 一是區域平衡的事, 請巫師在創造時想想怎樣的
    區域才不會讓人說閒話, 這一點要自己想好. 二是區域內不可以讓玩家在毫無預
    警的情況下意外死亡, 所謂預警包括寫在房間內, 寫在 mob 上, 用聽的用看的
    都可以. 三是區域內不可以有圖利玩家的東西或者命令. 例如無限生錢, 或者加
    強力量等等的東西.

02. 寫房間, 房間分兩種, 一是沒特殊功能的, 這是像平原山洞草地等房間, 另一種
    是有特殊功能的, 例如練功房, 書局, 商店, 藥店....etc...這一點最好是先拿
    自己的工作室來練習, 真要寫房間也請加入某一個大巫師的旗下之後再開始練習.

03. 寫 quests,  這應該也是玩 mud  的樂趣之一, 但是此項工作通常是巫師級以上
    的巫師寫的. 新手的您可以提供點子或者是幫忙測試或者是改進等等.

04. 寫 npc(mob),  mob 可以是為了 exp, 為了 eqs, 為了 quests, 為了 money,
    為了挑戰, 為了各種你想的到的目的, 甚至是娶 npc  當老婆(老公), 一起行走天
    涯, 這點變化性可是很大的. 最好各種 mob 都嘗試一下, 也最好強弱各種等級的
    都寫一寫.

05. 寫技巧, 我最希望每一項技巧都能有一段經歷配合, 也就是要學某一項技巧最好
    也都需要完成一項任務.

06. 寫寫說明文件, 在您寫任何檔案的同時, 希望您別忽略了寫說明文件.

07. 幫幫新巫師, 其實, 教學相長, 當玩家可以 party, 當巫師也行, 不是嗎!!
