inherit ROOM;
void create() {
	set( "short", "$HIR$天下第一拳 $HIC$大廳$NOR$" );
	set( "object", ([
		"amount1"  : 1,
		"file1"    : "/open/dancer/obj/maple_ribbon",
	]) );
	set( "owner", "bleak" );
	set( "light_up", 1 );
	set( "build", 1072 );
	set( "exits", ([
		"west"      : "/open/clan/ou-cloud-club/room/room304.c",
	]) );
	set( "long", @LONG
         
         ◢◣                          $,  $,     ,                      
      ◢◤  ◥◣                     'ss.$ss. .s'                       
   ◢◤ ◢█◣ ◥◣           ,     .ss$$$$$$$$$$s,                      
 ◢█   ███   █◣          $. s$$$$$$$$$$$$$$`$$Ss                    
   ◥◣ ◥█◤ ◢◤            `$$$$$$$$$$$$$$$$$$o$$$       ,           
      ◥◣  ◢◤            s$$$$$$$$$$$$$$$$$$$$$$$$s,  ,s            
         ◥◤                 s$$$$$$$$$*$$$$$$****$$$$$$*$$$$$,          
    天  拳  行  炎          s$$$$$$$$$$s**$$$$ssssss*$$$$$$$$*           
    下  風  走  龍         s$$$$$$$$$$'         ``**ss*$$$s**            
    第  神  江  拳          s$$$$$$$$$$,              ``****$  .s$$s     
    一  洲  湖  風          s$$$$$$$$$$$$s,...               `s$$'  `    
    無  不  天  戰      `ssss$$$$$$$$$$$$$$$$$$$$####s.     .$$*$.   , s-
    絕  獨  地  道        `***`$$$$$$$$$$$$$$$$$$$$#####$$$$$$*     $.$, 
    響  行  間  中              `$$$$$$$$$$$$$$$$$$$$$####s**     .$$$$  
    ，  。  ，  。               `$$$$$$$$$$$$$$$$$$$$$$$$##s*   .$$* $
LONG);
	setup();
	replace_program(ROOM);
}
