inherit ROOM;
void create() {
	set( "short", "$HIY$蒼龍巢$NOR$" );
	set( "owner", "taa" );
	set( "exits", ([
		"down"      : "/open/clan/ou-cloud-club/room/room555",
		"north"     : "/open/clan/ou-cloud-club/room/room619.c",
	]) );
	set( "long", @LONG

    ╭════════════◥███◣  ◣        ◢  ◢███◤════════════╮
　　║  仗劍昂首千丘遠               ◥███◣  ◢███◤               獨吾嘯傲狂風間  ║
　　║  堪尋敵手共論劍                     ◥||||||◤                     強絕高處不勝寒  ║
　　║  昨日黃昏愁滿地                     ●▲▼▲●                     雲崖夜雨落葉時  ║
　　║  西風獨颯誰共飲                      ╰▲▲╯                      約期未成秋華遲  ║
　　║  忘心無我欲沉醉           ●╮       ╰▲▲╯       ╭●           情遊天涯笑蒼穹  ║
　　║  潮浪不識劍中趣  ◢▆█◣   ╰──╮◢◎▼◎◣╭──╯   ◢█▆◣  臥看濁世現雲蹤  ║
　　║  龍氣狂絕覆雨風  〒〒〒█◣       ◥▲▼▲▼▲◤       ◢█〒〒〒  雲湧風起氣如虹  ║
　　║  劍傲一方獨霸世  ╰╰╰∪█          ||||||||          █∪╯╯╯  氣震雲驚動晴空  ║
　　╰══════════╰╯◥◤    ◥■  九天蒼龍  ■◤    ◥◤╰╯══════════╯

LONG);
	setup();
	replace_program(ROOM);
}
