// open/killer/ninja/find/r11b.c
#include "/open/open.h"
inherit ROOM;

void create ()
{
  set ("short", "心靈探索");
  set ("long", @LONG
  
  雖然老祖逐漸呈現敗象，但是你發現老祖的眼神並沒有放棄，
  且似乎有某種企圖，雖然只是小小的動作，
  但是你發現老祖手中已經持有許多暗器，看來老祖打算做最後一擊
  但是老祖似乎找不到最佳的機會出手，情況越來越危及
  你運足十成功力，宛如流星一般飛向老祖，同時放出身上的煙霧彈
  讓場中的焦點瞬間轉移，那人因為擔心門徒而分心了一下，
  但是高手對決這就是致命的，此瞬間老祖十足功力的霸雨.魔氣殺出手
  目標卻是仙劍門徒，這瞬間你也趁老祖發功後的空隙一手撈住他，
  快速的往反方向奔去........
  
 
LONG);

  set("item_desc", ([ /* sizeof() == 1 */
  "下山" : "渾沌的過去....必須要自己去探索\n",
  "上山" : "渾沌的過去....必須要自己去探索\n",
  "樹林" : "渾沌的過去....必須要自己去探索\n",]));
  
  set("exits", ([ /* sizeof() == 1   */
     "下山" : __DIR__"r12b.c",  
     "上山" : __DIR__"rx23.c",  
     "樹林" : __DIR__"rx24.c",   ]));
  set("no_transmit",2);
  setup();
}
