// open/killer/ninja/find/r12a.c
#include "/open/open.h"
inherit ROOM;

void create ()
{
  set ("short", "心靈探索");
  set ("long", @LONG
  
    連老祖都沒把握對付的人到底是誰，雖然你有滿腔的好奇心
    但是為保護內傷未癒的柴榮，你決定快速的跟柴榮一起離開！！
    當你跟柴榮兩人聯手逃到山下的時候，居然被一群下山搜尋的魔教徒圍攻
    雖然這些蝦兵蟹將並不強，但是在你不敢使用魔氣殺的情況下。
    而且柴榮也跟你分開有一段距離，戰況越來越危及了，
    這時候，戰況出現了很詭異的現象，因為有另外一群人過來.
    居然是葉秀殺？ 而且被一群金刀武士追殺.........
    沒多久兩群人馬已經混在一起，柴榮正好跟葉秀殺並肩作戰
    但是因為對方人多勢眾，兩人逐漸陷入危機......
    
LONG);

  set("item_desc", ([ /* sizeof() == 1 */
  "衝過去" : "渾沌的過去....必須要自己去探索\n",
  "各自作戰" : "渾沌的過去....必須要自己去探索\n",
  "逃走" : "渾沌的過去....必須要自己去探索\n",]));
 
  set("exits", ([ /* sizeof() == 1   */
     "各自作戰" : __DIR__"r15x.c",   
     "衝過去" : __DIR__"r13a.c",   
     "逃走" : __DIR__"r16x.c",   ]));
  set("no_transmit",2);
  setup();
}
