// open/killer/ninja/find/r12b.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
"     你帶著老祖，快速的往山下逃去，因為再怎麼樣強敵，至少往黑牙連去，\n"
"     總是你比較熟悉的地點，然而老祖似乎不願意往總壇前去\n"
"     反而要你前往殺手後山墓園的土地公廟前去......\n"
"     在老祖的要求下，你運足勁，快速的來到的土地公廟。\n"
HIG + "     老祖：『目前中原武林，危機四伏，各派都有被滲透，\n"
"     因為設法解決掉這一些人，已經被各派誤會很深，但卻無法解釋!\n"
"     目前黑牙連並沒有人可以對付那個仙劍老鬼，回總壇只是多加犧牲。\n"
"     你先在這裡等待一下，我去北方的墓碑處，設計一下機關，立刻回來。\n"
"     說完之後，老祖就自己一個人往北方走去.......\n" + NOR
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "偷看" : "渾沌的過去....必須要自己去探索\n",
  "等待" : "渾沌的過去....必須要自己去探索\n",]));
  
  set("exits", ([ /* sizeof() == 1   */
     "等待" : __DIR__"r13b.c",  
     "偷看" : __DIR__"rx25.c",   ]));
  set("no_transmit",2);
  setup();
}
