// open/killer/ninja/find/r3.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
"     你一路尾隨柴榮來到了山上的某處水潭附近，此處風景優美，令人神往\n"
"     莫非柴榮還有心情來此看風景？ 只見柴榮從懷中取出一把匕首，赫然是『" + HIC + "滅神匕首" + NOR + "』\n"
HIY + "     柴榮看著匕首長嘆：『小柔，看來我們勢必有很長一段時間無法見面了.......』\n" + NOR
HIY + "     正當柴榮看著匕首之時，由背後傳來破空聲，一條黑影擊向柴榮!!\n" + NOR
"     來物速度非常的快速，你是否要幫柴榮攔下這一東西呢？？!\n"
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "不管" : "渾沌的過去....必須要自己去探索\n",
  "用暗器" : "渾沌的過去....必須要自己去探索\n",
  "身體擋" : "渾沌的過去....必須要自己去探索\n",
  "魔氣殺" : "渾沌的過去....必須要自己去探索\n",
                   ]));
   
  set("exits", ([ /* sizeof() == 1   */
     "不管" : __DIR__"r4.c",   
     "用暗器" : __DIR__"rx2.c",   
     "身體擋" : __DIR__"rx3.c",   
     "魔氣殺" : __DIR__"rx4.c",   
]));
  setup();
}
