// open/killer/ninja/find/r4.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
"     你決定不管柴榮的死活，反正可以活到教你魔氣殺，沒理由比你早死的...\n"
HIY + "     果然，柴榮察覺破空聲，身影一閃，快速的身影讓黑影只有擊中殘影？？!\n" + NOR
HIY + "     柴榮順手抓住黑影，才發現竟是鞭子，魔教掌門信物『" + HIW + "雪龍鞭" + NOR+HIY + "』。\n" + NOR
HIY + "     『是你？小柔.....你也是來追殺我的嗎？......』  柴榮有點無奈的說。\n" + NOR
HIR + "     莊靜柔恨恨的：\n" + NOR
HIR + "     『柴榮，你竟敢為了天魔解體大法，刻意接近我欺騙我的感情，\n" + NOR
HIR + "     想不到你竟是如此卑鄙的小人，交出天魔解體大法，留你全屍!』\n" + NOR
HIY + "     柴榮身影一震，似乎沒有想到，短短時間之內，心愛的人竟然想法有這麼大的轉變\n" + NOR
HIY + "     想必是被人家刻意誤導與洗腦，看來今天是無法解釋清楚了!!\n" + NOR
"     在一旁看了覺得很心酸的你，決定.........\n"
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "繼續看戲" : "渾沌的過去....必須要自己去探索\n",
  "幫忙解釋" : "渾沌的過去....必須要自己去探索\n",  ]));
   
  set("exits", ([ /* sizeof() == 1   */
     "幫忙解釋" : __DIR__"rx5.c",   
     "繼續看戲" : __DIR__"r5.c",   ]));
  setup();
}
