// open/killer/ninja/find/r5.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
HIY + "     柴榮心知無法解釋清楚，也不願意自己心愛的人因為持有天魔大法，\n" + NOR
HIY + "     反而可能陷入下一波的危機當中，因此也決定自己來承受這一切了。\n" + NOR
HIY + "     柴榮眼睛一閉：『天魔解體大法，我是不會交出來的，有辦法你就把我殺了吧!』\n" + NOR
HIR + "     『你以為我不敢把你殺了嗎？』 莊敬柔憤怒的說著，同時鞭子也往柴榮攻擊而去。\n" + NOR
HIR + "     貫足十成功\力的鞭子，宛如長槍一般的，貫穿了柴榮的腹部？!!\n" + NOR
HIR + "     莊靜柔似乎沒想到柴柔居然不避不閃，一瞬間愣了一下，\n" + NOR
HIR + "     鞭子一端握在莊靜柔的手中，一端停在柴榮的體內，整個空氣彷彿凝結住了!!\n" + NOR
HIR + "     『你？！』 莊靜柔一咬牙，再次把鞭子抽出，往柴榮抽去!!\n" + NOR
HIY + "     『啪！』的一聲，柴榮身上已經多了一道深深的鞭痕.......\n" + NOR
HIY + "     莊靜柔並不手軟的不斷的往柴榮抽去，似乎在宣洩心中的悲痛......\n" + NOR
HIY + "     不過，明眼人一看就知道，鞭子的力道已經越來越輕.......\n" + NOR
HIG + "     豈知這時候，你的背後居然傳來一聲：『小子，你在幹什麼？？？』\n" + NOR
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "我在看戲" : "渾沌的過去....必須要自己去探索\n",
  "反身攻擊" : "渾沌的過去....必須要自己去探索\n",
  "偷窺" : "渾沌的過去....必須要自己去探索\n",  ]));
   
  set("exits", ([ /* sizeof() == 1   */
     "我在看戲" : __DIR__"rx6.c",   
     "反身攻擊" : __DIR__"rx7.c",   
     "偷窺" : __DIR__"r6.c",   ]));
  setup();
}
