// open/killer/ninja/find/r6.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
HIG"     『偷窺？有什麼好戲呀，我也一起來好了』背後的那個聲音的主人，也躲在你身旁。\n"NOR
"     你仔細了看了他一眼，發現此人的頭髮居然都是綠色的，且年紀也不輕，莫非.....\n"
HIR"     由於莊靜柔在鞭子並沒有用上真力，使得雪白的鞭子上不斷的沾染上柴榮的鮮血...\n"NOR
HIR"     原本雪白的雪龍鞭，已經逐漸被鮮血染成紅色.........\n"NOR
HIG"     『柴榮？我那笨徒弟在幹嘛？！』 此人發現對象居然是柴榮的時候，不禁脫口說出。\n"NOR
"     你眼前一花，此人已經立刻化成一道光影衝出去，身法極為類似『幻星步』？!\n"NOR
"     此人莫非是殺手的第一代主席，"HIG"綠毛老祖？！"NOR"而且聽他語氣，莫非柴榮竟是他徒弟？\n"NOR
"     這時候你決定？？？"
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "衝出去" : "渾沌的過去....必須要自己去探索\n",
  "繼續看戲" : "渾沌的過去....必須要自己去探索\n",
  "離開現場" : "渾沌的過去....必須要自己去探索\n",  ]));
   
  set("exits", ([ /* sizeof() == 1   */
     "衝出去" : __DIR__"r7a.c",   
     "繼續看戲" : __DIR__"rx8.c",   
     "離開現場" : __DIR__"r7b.c",   ]));
  set("no_transmit",2);
  setup();
}
