// open/killer/ninja/find/r8a.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
"     反正賊都已經上了賊船，乾脆一不做二不休，干涉的過癮一點\n"
"     立刻使出殺手的藏匿術，躲藏在一邊。\n"
HIG + "     老祖看了一眼：『聰明。』\n" + NOR
HIG + "     隨即便使出內功\心法與黑牙神功\奧義『化氣成針』! \n" + NOR
HIG + "     一根氣針射入柴榮體內，先行幫柴榮驅除體內的毒氣與內傷.....\n" + NOR
"     正當行功\到緊要關頭時，一個魔教徒悄悄的走過來，並且取出毒藥打算施毒\n"
"     但是，一把匕首已經由他的背部貫穿心臟，這當然是你的傑作。\n"
"     正當你得意的時候，一群人已經搜到此處了........\n"
"     由服飾看起來，應該都是魔教的一般弟子，雖然不強但勢必要花上一番功\夫\n"
"     而且有可能引起其他人的注意......你該如何是好？\n"
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "奮戰" : "渾沌的過去....必須要自己去探索\n",
  "投降" : "渾沌的過去....必須要自己去探索\n",
  "逃走" : "渾沌的過去....必須要自己去探索\n",]));
   
  set("exits", ([ /* sizeof() == 1   */
     "投降" : __DIR__"r11x.c",   
     "奮戰" : __DIR__"r10a.c",   
     "逃走" : __DIR__"r12x.c",   ]));
  set("no_transmit",2);
  setup();
}
