// open/killer/ninja/find/r9b.c
#include <ansi.h>
#include "/open/open.h"
inherit ROOM;

void create ()
{
  string long;
  set ("short", "心靈探索");
  long = "\n"
"     可惡，你絕對相信殺手的訓練，心一橫，當成沒事的人，在隊伍之中待機\n"
"     果然，那個人的目標並不是你，強大的劍氣宛如波濤一般\n"
"     化成奪命的光影，往前方襲去，如此強大的威力，前所未見\n"
"     就算是仙劍後三式，也沒有如此的威力!!!\n"
"     你隱約聽到『仙劍後九式之.....』就被巨大的破壞聲干擾了....\n"
"     想不到仙劍還有另外的後六式？\n"
"     雖然你有滿腔的疑惑，但是隊伍已到那股強大的力量之處\n"
"     果然是先前那一位綠毛的前輩，但是柴榮已經不在他身邊。\n"
HIG + "     『太小看我了吧，居然才用仙劍後九式的第五式對我......』\n" + NOR
HIC + "     那人沉聲道：『綠毛老鬼，先前殺了敝派數十名弟子的人，是不是你們的人？』\n" + NOR
HIG + "     『哼....我如果說不是，你會相信嗎？ 你們不是已經集結八大派了？』\n" + NOR
HIC + "     那人：『你們黑牙連殺人無數，教我們如何相信你？給你機會自盡吧!』\n" + NOR
HIG + "     『放屁，多說無益....魔氣殺!』老祖話說的到一半，就動手了。\n" + NOR
  "\n";
  set("long", long);
  set("item_desc", ([ /* sizeof() == 1 */
  "觀戰" : "渾沌的過去....必須要自己去探索\n",
  "插手" : "渾沌的過去....必須要自己去探索\n",]));
  
  set("exits", ([ /* sizeof() == 1   */
     "插手" : __DIR__"rx20.c",
     "觀戰" : __DIR__"r10b.c",   ]));
  set("no_transmit",2);
  setup();
}
