inherit ROOM;
#include <ansi.h>

void create ()
{
  set ("short", "隔世橋");
  set ("long", @LONG
走上橋面，這座橋似乎已有上百年的歷史，歲月的痕跡，一刀刀
的刻畫在這座橋上，河面的清風微微的吹了過來，置身此橋有種如隔
世般的感覺，橋頭上有一塊石碑 (stone)，上面似乎題了四個大字，
你可以走近一看。
LONG);

  set("item_desc", ([ /* sizeof() == 1 */
  "stone" : "
╰═╬═══╬═╯  ║    ║  ║        ╭═╯  ║      ║   ═╦╩╦═
  ╭═╦═╦═╮  ╰╩╗═╩═╰═╯╭═╯  ╮  ║  ╭  ║   ═╩═╩═
╭╩╦╩═╩═╩╮  ╭╯║═╮══╗║  ║  ║  ║  ║═╬═ ╠═══╣
║╭╯╦═══╮║　╰╗║  ║═╬═    ║  ║  ║  ║  ║   ╰╦═╦╯
      ╰╮╭═╯  ╔╦╯╯  ╯  ╯      ║  ║  ║  ║═╩═ ╭╯  ║
      ╭═╯        ╰══════╯    ╯  ╰═╩═╯       ╯    ╰═

",
]));
  set("objects", ([ /* sizeof() == 1 */
  __DIR__"obj/bembem.c" : 1,
]));
  set("exits", ([ /* sizeof() == 2 */
  "north" : __DIR__"mon07",
  "south" : __DIR__"mon05",
]));

  setup();
}
